[
    {
      "id": 0,
      "title": "MoneyMate",
      "slug": "moneymate",
      "imgLink": "https://imagizer.imageshack.com/img924/8717/mO8TUj.png",
      "description": "MoneyMate is a comprehensive personal finance management tool designed to help users track, analyze, and optimize their expenses. The platform offers intuitive features for logging daily expenses, categorizing transactions, and visualizing spending patterns through detailed charts and graphs. It comes with a user-friendly dashboard that includes key financial insights, such as total spending, category-wise distribution, and weekly trends, all displayed in real-time. Built with modern web technologies like React for the frontend and Node.js with Express for the backend, MoneyMate ensures smooth performance and a highly interactive experience. The application leverages MongoDB for robust data storage, allowing users to securely store and access their financial data. With Chart.js integration, users can view their financial data in engaging visual formats, making it easier to identify spending habits. Future enhancements include AI-powered financial advice and savings tips tailored to user behavior, making MoneyMate not just a tracker, but a true companion for achieving financial goals. Fully responsive and optimized for both desktop and mobile, MoneyMate is the perfect tool for individuals looking to take control of their finances.",
      "techStack": [
        "React.js",
        "Bootstrap",
        "chart.js",
        "Node.js",
        "Express",
        "MongoDB"
      ],
      "githubLink": "https://github.com/MananKanani5/moneymate-backend",
      "previewLink": "https://moneymate-frontend-omega.vercel.app/",
      "gallery": [
        "https://imagizer.imageshack.com/img924/6856/8lKBgA.jpg",
        "https://imagizer.imageshack.com/img923/2829/vUcsSz.png",
        "https://imagizer.imageshack.com/img923/3966/8X0xKM.png",
        "https://imagizer.imageshack.com/img922/1503/UBc1Ve.png"
      ]
    },
    {
      "id": 1,
      "title": "BlogIt",
      "slug": "blogit",
      "imgLink": "https://imagizer.imageshack.com/img924/8938/fY1WJJ.png",
      "description": "BlogIt is a dynamic blogging platform designed to offer a seamless and intuitive user experience. It allows users to create, edit, and publish blogs with ease. The platform features a rich text editor that supports multimedia, including images and videos, and provides a variety of customizable themes to enhance the overall aesthetics of each blog post. BlogIt also includes a user-friendly interface for managing content, with real-time previews and automatic saving to prevent data loss. Built with modern technologies such as React for the frontend, Node.js and Express for the backend, and MongoDB for database management, the platform ensures fast, reliable performance. Tailwind CSS is used for styling, enabling a clean, responsive design that adapts perfectly to both desktop and mobile devices. Whether you're an individual blogger or part of a larger content team, BlogIt empowers you to share your voice and engage with an online audience effectively.",
      "techStack": ["ejs", "Tailwind CSS", "Node.js", "Express", "MongoDB"],
      "githubLink": "https://github.com/MananKanani5/blogit",
      "previewLink": "https://blogiit-e3bc98a44335.herokuapp.com/",
      "gallery": [
        "https://imagizer.imageshack.com/img924/6913/LLt0vh.png",
        "https://imagizer.imageshack.com/img922/2667/L4mkFY.png",
        "https://imagizer.imageshack.com/img922/6567/bluDLp.png",
        "https://imagizer.imageshack.com/img924/6043/N00B0h.png",
        "https://imagizer.imageshack.com/img924/4572/8PzkZR.png",
        "https://imagizer.imageshack.com/img924/6726/ZSHEke.png",
        "https://imagizer.imageshack.com/img923/4939/qLBscK.png",
        "https://imagizer.imageshack.com/img924/5264/uaR1Yi.png"
      ]
    },
    {
      "id": 2,
      "title": "PawFinder",
      "slug": "pawfinder",
      "imgLink": "https://imagizer.imageshack.com/img924/1315/Kklk7v.png",
      "description": "PawFinder is a compassionate and user-friendly responsive web app dedicated to addressing the heart-wrenching issue of lost pets. At the heart of PawFinder is a contemporary web development stack, combining the power of HTML, CSS, and JavaScript to craft an interface. In the backend, I've used PHP to ensure the secure handling of data, and I rely on the reliability of a MySQL database to safeguard the precious information collected. The result is a web app that offers a seamless and optimized viewing experience on a wide range of devices, including desktop computers, tablets, and mobile phones. Whether you're searching for a lost pet from the comfort of your home or on the go, PawFinder is there to assist. PawFinder is more than just technology; it's a movement, a collective effort to bring solace and joy back to pet owners who have lost their cherished companions. I understand the deep distress that comes with a lost pet, and my platform is designed to streamline the process of reuniting them with their loving families. It's a digital space where empathy and support thrive.",
      "techStack": ["HTML", "CSS", "JavaScript", "PHP", "MYSQL"],
      "githubLink": "https://github.com/MananKanani5/PawFinder",
      "previewLink": "https://pawfinder.free.nf",
      "gallery": [
        "https://imagizer.imageshack.com/img922/483/8M2Ovx.png",
        "https://imagizer.imageshack.com/img924/9967/gQMFY1.png",
        "https://imagizer.imageshack.com/img924/1642/xtdSVz.png",
        "https://imagizer.imageshack.com/img922/3632/ctF2nQ.png"
      ]
    },
    {
      "id": 3,
      "title": "MM Sarkar Taxi Services",
      "slug": "mm-sarkar-taxi-services",
      "imgLink": "https://res.cloudinary.com/dk4fzbjt9/image/upload/v1742042149/Portfolio/mmsarkar/akpbzsnigyxqdrjfapxw.png",
      "description": "MM Sarkar Taxi Services is dedicated to providing the best travel experience. Their mission is to ensure every journey is safe, reliable, and affordable. The company boasts a team of professional drivers and well-maintained vehicles, always ready to meet customers' transportation needs. From short rides across town to longer trips, MM Sarkar Taxi Services guarantees a smooth and comfortable experience every time. With a strong focus on customer satisfaction, the company strives to deliver excellent service from the moment a ride is booked to the final destination.",
      "techStack": ["WordPress", "CSS", "MYSQL"],
      "githubLink": "NA",
      "previewLink": "NA",
      "gallery": [
          "https://res.cloudinary.com/dk4fzbjt9/image/upload/v1742041491/Portfolio/mmsarkar/ypdymzqljmid9lxbt5x4.webp", 
          "https://res.cloudinary.com/dk4fzbjt9/image/upload/v1742041491/Portfolio/mmsarkar/vkwuohjy54j54erpzg3a.webp"
      ]
    },
    {
      "id": 4,
      "title": "Passport Academy",
      "slug": "passport-academy",
      "imgLink": "https://res.cloudinary.com/dk4fzbjt9/image/upload/v1742041943/Portfolio/passportacademy/mgh2yeqchgtga4em7i6s.png",
      "description": "Passport Academy is dedicated to providing exciting learning experiences that help children excel throughout the year. They strive to support students and families year-round with tailored educational services. The academy offers remediation to bridge gaps in math and reading, assistance with projects to ensure they meet all requirements, and guidance on mastering difficult skills or concepts. For international students, Passport Academy provides specialized support to help them learn English effectively. With certified teachers, personalized and small group sessions, and a focus on fun, purposeful learning, Passport Academy goes beyond traditional education to help every child succeed.",
      "techStack": ["WordPress", "CSS", "MYSQL"],
      "githubLink": "NA",
      "previewLink": "https://passportacademy.net/",
      "gallery": [
          "https://res.cloudinary.com/dk4fzbjt9/image/upload/v1742041631/Portfolio/passportacademy/lwy8grezspbeea9s8kxt.webp", 
          "https://res.cloudinary.com/dk4fzbjt9/image/upload/v1742041631/Portfolio/passportacademy/uih43tfghqf4stgtuhd2.webp"
      ]
    }
  ]
